Objectives 
Part 1: Build the Network and Configure Basic Device Settings 
Part 2: Configure and Verify Routing 
Part 3: Configure PBR to Provide Path Control 
Part 4: Configure Local PBR to Provide Path Control 
Background / Scenario 
In this scenario, you want to experiment with policy-based routing (PBR) to see how it is implemented 
and study how it could be used to influence path selection. 
Your task is to connect and configure a 3 router and 2 Layer 3 switch OSPF routing domain and verify 
normal path selection. You will alter the traffic flow for PC2 going to PC3 using PBR. You will also use 
Cisco IOS IP SLA with PBR to achieve dynamic path control. Finally, you will configure PBR for traffic 
originating locally on router R1. 
Part 1:Build the Network and Configure Basic Device Settings 
In Part 1, you will set up the network topology and configure basic settings and interface addressing on 
routers. 

                 g1/0 [R2] g3/0

[ R1 ]g1/0                               g3/0[ R3 ]
   - g4/0                                      -g4/0
   -                                           -
   -                                           -
 [ESW1]f0/0                                  [ESW2]f0/0

Attach the devices as shown in the topology diagram, and cable as necessary. 
Step 2:Configure basic settings for each device. 
Console into each device, enter global configuration mode, and apply the basic settings. The startup 
configurations for each device are provided below

Router R1 
R1# 
R1#conf t 
Enter configuration commands, one per line.  End with CNTL/Z. 
R1(config)#hostname R1 
R1(config)#no ip domain lookup 
R1(config)#line con 0 
R1(config-line)#logging sync 
R1(config-line)#exec-time 0 0 
R1(config-line)#exit 
R1(config)#banner motd # This is R1, Path Control Using PBR # 
R1(config)#int g1/0 
R1(config-if)#description Connection to R2 
R1(config-if)#ip add 172.16.0.2 255.255.255.252 
R1(config-if)#no shut 
R1(config-if)#exit 
R1(config)#int p 
*Nov 29 10:28:35.795: %LINK-3-UPDOWN: Interface GigabitEthernet1/0, changed state to up 
*Nov 29 10:28:36.795: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet1/0, 
changed state to up 
R1(config)#int p2/0 
R1(config-if)#description Serial Connection to R3 
R1(config-if)#ip add 172.16.2.1 255.255.255.252 
R1(config-if)#no shut 
R1(config-if)#exit 
R1(config)# 
*Nov 29 10:29:01.855: %LINK-3-UPDOWN: Interface POS2/0, changed state to up 
R1(config)# 
*Nov 29 10:29:02.863: %LINEPROTO-5-UPDOWN: Line protocol on Interface POS2/0, changed state to 
up 
R1(config)#int g4/0 
*Nov 29 10:29:26.967: %LINEPROTO-5-UPDOWN: Line protocol on Interface POS2/0, changed state to 
down 
R1(config-if)#description Connection to D1 
R1(config-if)#ip add 10.10.0.1 255.255.255.252 
R1(config-if)#no shut 
R1(config-if)#exit 
R1(config)# 
*Nov 29 10:29:35.043: %LINK-3-UPDOWN: Interface GigabitEthernet4/0, changed state to up 
*Nov 29 10:29:36.043: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet4/0, 
changed state to up 

R1(config)#exit 
R1#copy running-config startup-config 


***Router R2 
R2#conf t 
Enter configuration commands, one per line.  End with CNTL/Z. 
R2(config)#hostname R2 
R2(config)#no ip domain lookup 
R2(config)#line con 0 
R2(config-line)#logging sync 
R2(config-line)#exec-time 0 0 
R2(config-line)#exit 
R2(config)#banner motd # This is R2, Path Control Using PBR # 
R2(config)#int g1/0 
R2(config-if)#description Connection to R1 
R2(config-if)#ip add 172.16.0.1 255.255.255.252 
R2(config-if)#no shutdown 
R2(config-if)#exit 
*Nov 29 10:30:27.927: %LINK-3-UPDOWN: Interface GigabitEthernet1/0, changed state to up 
*Nov 29 10:30:28.927: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet1/0, 
changed state to up 
R2(config-if)#exit 
R2(config)#int g3/0 
R2(config-if)#description Connection to R3 
R2(config-if)#ip address 172.16.1.1 255.255.255.252 
R2(config-if)#no shut 
R2(config-if)#exit 
R2(config)# 
*Nov 29 10:30:55.203: %LINK-3-UPDOWN: Interface GigabitEthernet3/0, changed state to up 
*Nov 29 10:30:56.203: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet3/0, 
changed state to up 
R2(config)#do copy running-config startup-config 


Router R3 
R3#conf t 
Enter configuration commands, one per line.  End with CNTL/Z. 
R3(config)#hostname R3 
R3(config)#no ip domain lookup 
R3(config)#line con 0 
R3(config-line)#logging sync 
R3(config-line)#exec-time 0 0 
R3(config-line)#exit 
R3(config)#banner motd # This is R3, Path Control Using PBR # 
R3(config)#int g3/0 
R3(config-if)#description Connection to R2 
R3(config-if)#ip add 172.16.1.2 255.255.255.252 
R3(config-if)#no shut 
R3(config-if)#exit 
R3(config)# 
*Nov 29 10:31:51.171: %LINK-3-UPDOWN: Interface GigabitEthernet3/0, changed state to up 
*Nov 29 10:31:52.171: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet3/0, 
changed state to up 
R3(config)#int p2/0 
R3(config-if)#description Serial Connection to R1 
R3(config-if)#ip add 172.16.2.2 255.255.255.252 
R3(config-if)#no shut 
R3(config-if)#exit 
R3(config)# 
*Nov 29 10:32:06.571: %LINK-3-UPDOWN: Interface POS2/0, changed state to up 
*Nov 29 10:32:07.571: %LINEPROTO-5-UPDOWN: Line protocol on Interface POS2/0, changed state to 
up 
R3(config)#int g4/0 
R3(config-if)#description Connection to D2 
R3(config-if)#ip add 192.168.0.1 255.255.255.252 
R3(config-if)#no shut 
R3(config-if)#exit 

Switch1 D1 
ESW1#conf t 


ESW1(config)#hostname D1 
D1(config)#no ip domain lookup 
D1(config)#line con 0 
D1(config-line)#exec-timeout 0 0 
D1(config-line)#logging synchronous 
D1(config-line)#exit 
D1(config)#banner motd # This is D1, Path Control Using PBR # 
D1(config)#int f0/0 
D1(config-if)#description Connects to R1 
D1(config-if)#ip address 10.10.0.2 255.255.255.252 
D1(config-if)#no shut 
D1(config-if)#exit 
D1(config)#interface Loopback 1 
D1(config-if)#description Interface simulates network 
D1(config-if)#ip ospf network point-to-point 
D1(config-if)#ip address 10.10.1.1 255.255.255.0 
D1(config-if)#exit 
D1(config)#interface Loopback 2 
D1(config-if)#description Interface simulates network 
D1(config-if)#ip ospf network point-to-point 
D1(config-if)#ip address 10.10.2.1 255.255.255.0 
D1(config-if)#exit 

Switch2 D2 
SW2#conf t 
Enter configuration commands, one per line.  End with CNTL/Z. 
ESW2(config)#hostname D2 
D2(config)#no ip domain lookup 
D2(config)#line con 0 
D2(config-line)#logging sync

D2(config-line)#exec-time 0 0 
D2(config-line)#exit 
D2(config)#banner motd # This is D2, Path Control Using PBR # 
D2(config)#int f0/0 
D2(config-if)#description Connects to R3 
D2(config-if)#ip address 192.168.0.2 255.255.255.252 
D2(config-if)#no shut 
D2(config-if)#exit 
D2(config)#interface Loopback 1 
D2(config-if)#description Interface simulates network 
D2(config-if)#ip ospf network point-to-point 
D2(config-if)#ip address 192.168.1.1 255.255.255.0 
D2(config-if)#exit 
*Mar  1 00:08:03.811: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback1, changed state 
to up 
D2(config-if)#exit

D2(config-if)#exit 
D2(config)#exit 
D2#conf t 

Part 2:Configure and Verify Routing 
Step 1:Configure Routing. 
In this step, you will configure OSPF. 
Open configuration window 
In Part 2, you will implement OSPF routing for the routing domain and verify end to end routing. 
1.On D1, advertise the connected networks using OSPF process ID 123. Also assign D1 the router ID of 
1.1.1.2 and set the reference bandwidth to recognize Gigabit Ethernet interfaces. 
D1(config)# 
D1(config)#ip routing 
D1(config)#router ospf 123 
D1(config-router)#router-id 1.1.1.2 
D1(config-router)# auto-cost reference-bandwidth 1000 
% OSPF: Reference bandwidth is changed. 
Please ensure reference bandwidth is consistent across all routers. 
D1(config-router)# network 10.10.0.0 0.0.0.3 area 0 
D1(config-router)# network 10.10.1.0 0.0.0.255 area 0 
D1(config-router)#network 10.10.2.0 0.0.0.255 area 0 

D1(config-router)#end 
D1# 
*Mar  1 00:11:30.655: %SYS-5-CONFIG_I: Configured from console by console 
D1# 

2.On R1, advertise the connected networks using OSPF process ID 123. Also assign R1 the router ID of 
1.1.1.1 and set the reference bandwidth to recognize Gigabit Ethernet interfaces. 
Open configuration window 
R1#conf t 
Enter configuration commands, one per line.  End with CNTL/Z. 
R1(config)# router ospf 123 
R1(config-router)#router-id 1.1.1.1 
R1(config-router)# auto-cost reference-bandwidth 1000 
% OSPF: Reference bandwidth is changed. 
Please ensure reference bandwidth is consistent across all routers. 
R1(config-router)#network 10.10.0.0 0.0.0.3 area 0 
R1(config-router)# network 172.16.0.0 0.0.0.3 area 0 
R1(config-router)# 
*Nov 29 10:39:52.079: %OSPF-5-ADJCHG: Process 123, Nbr 1.1.1.2 on GigabitEthernet4/0 from 
LOADING to FULL, Loading Done 
R1(config-router)# network 172.16.2.0 0.0.0.3 area 0 
R1(config-router)#end


3.On R2, advertise the connected networks using OSPF process ID 123. Also assign R2 the router ID of 
2.2.2.1 and set the reference bandwidth to recognize Gigabit Ethernet interfaces. 
Open configuration window 
R2(config)#router ospf 123 
R2(config-router)#router-id 2.2.2.1 
R2(config-router)#auto-cost reference-bandwidth 1000

R2(config-router)#auto-cost reference-bandwidth 1000 
R2(config-router)#network 172.16.0.0 0.0.0.3 area 0 
R2(config-router)# 
*Nov 29 10:41:18.355: %OSPF-5-ADJCHG: Process 123, Nbr 1.1.1.1 on GigabitEthernet1/0 from 
LOADING to FULL, Loading Done 
R2(config-router)#network 172.16.1.0 0.0.0.3 area 0 
R2(config-router)#end


R3(config)# router ospf 123 
R3(config-router)# router-id 3.3.3.1 
R3(config-router)# auto-cost reference-bandwidth 1000 
% OSPF: Reference bandwidth is changed. 
Please ensure reference bandwidth is consistent across all routers. 
R3(config-router)# network 192.168.0.0 0.0.0.3 area 0 
R3(config-router)# network 172.16.1.0 0.0.0.3 area 0 
R3(config-router)# network 172.16.2.0 0.0.0.3 area 0 
R3(config-router)# end

D2(config)# ip routing 
D2(config)# router ospf 123 
D2(config-router)# router-id 3.3.3.2 
D2(config-router)# auto-cost reference-bandwidth 1000 

D2(config-router)# network 192.168.0.0 0.0.0.3 area 0 
D2(config-router)# network 192.168.1.0 0.0.0.255 area 0 
D2(config-router)# end 

D1#show ip route ospf | begin Gateway 

D2# show ip route ospf | begin Gateway 

R1#show ip route ospf | begin Gateway

R2#show ip route ospf | begin Gateway 

R3# show ip route ospf | begin Gateway 

D1#ping 192.168.1.1 source 10.10.1.1

D1#traceroute 192.168.1.1 source 10.10.1.1 

D1#ping 192.168.1.1 source lo 2

D1#traceroute 192.168.1.1 source lo 2 

D1# traceroute 192.168.1.1 source lo 2

R1# show ip route ospf | begin Gateway


Part 3:Configure PBR to Provide Path Control 
Recall that route maps can be used for: 
Redistribution – Route maps provide more options and flexibility to the redistribute command. 
Policy-based routing (PBR) – PBR allows an administrator to define routing policy other than basic 
destination-based routing using the routing table. The route map is applied to an interface using the ip 
policy route-map interface configuration command. 

R1#conf t 
Enter configuration commands, one per line.  End with CNTL/Z. 
R1(config)#ip access-list standard Lo2-ACL 
R1(config-std-nacl)#remark ACL matches D1 Lo2 traffic 
R1(config-std-nacl)# permit 10.10.2.0 0.0.0.255 
R1(config-std-nacl)#exit 

R1(config)# route-map R1-to-R3 permit 
R1(config)# 

R1(config)#route-map R1-to-R3 permit 
R1(config-route-map)#description RM to forward Lo2 traffic to R3 
R1(config-route-map)#match ip address Lo2-ACL 
R1(config-route-map)#set ip next-hop 172.16.2.2 
R1(config-route-map)#exit 

R1(config)# 
R1(config)#int g4/0 
R1(config-if)#ip policy route-map R1-to-R3 
R1(config-if)#end

R1# show route-map 
R1#show route-map 
R1#show route-map 
